/************************************************************************************** 
*   日期    ：2013年11月6日 (版权所有，翻版必究) 
*   目标    ：ARM Cortex-M0 LPC1114 
*   编译环境：KEIL 4.60
*   外部晶振：10Mhz(主频50M)
*   功能    ：学会使用串口中断
*   作者    ：Ration
*   官方网址：http://www.rationmcu.com
*   淘宝店  ：http://ration.taobao.com
**************************************************************************************/
#include "lpc11xx.h"
#include "uart.h"

uint8_t rec_buf;

/***********************************/
/* 函数名称：串口中断函数          */
/***********************************/
void UART_IRQHandler(void)
{
	uint32_t IRQ_ID;		  // 定义读取中断ID号变量
	uint8_t rec_buf;    // 定义接收数据变量数组

	IRQ_ID = LPC_UART->IIR;   // 读中断ID号
	IRQ_ID =((IRQ_ID>>1)&0x7);// 检测bit3:bit1	
	if(IRQ_ID == 0x02 )		  // 检测是不是接收数据引起的中断
	{
			rec_buf = LPC_UART->RBR;
			UART_send_byte(rec_buf); // 把接收到的字节发回串口
	}
}
/**********************************************/
/*               主函数                       */
/**********************************************/
int main()
{
	UART_init(115200); // 把串口波特率配置为9600
	LPC_UART->IER = 0x01;  // 开启接收中断
	NVIC_EnableIRQ(UART_IRQn); // 开串口中断
	
	while(1)
	{
		;
	}
}







